<?php
// 以下をfor文を使用して表示してください。
// ヒント: if〜elseifを使用

// ****1
// ***121
// **12321
// *1234321
// 123454321
// *1234321
// **12321
// ***121
// ****1

for($i = 1;$i < 10;$i++)
{
    if($i <= 5)
    {
        for($k = 5;$k > $i;$k--)
        {
            echo "*";
        }
        for($j = 1;$j <= $i;$j++)
        {
            echo $j;
        }
        for($s = $i;$s > 1;$s--)
        {
            echo $s-1;
        }
    }
    else if($i > 5)
    {
        for($d = 0;$d < $i - 5;$d++)
        {
            echo "*";
        }
        for($f = 1;$f <= 10-$i;$f++)
        {
            echo $f;
        }
        for($g = 9-$i;$g > 0;$g--)
        {
            echo $g;
        }
    }

    echo '<br>';
}

?>